ChibiOS/ChibiOS/os/hal/platforms/STM32/i2c_lld.c
#if STM32_I2C_USE_I2C3
    if (&I2CD3 == i2cp) {

      bool_t b;
      b = dmaStreamAllocate(i2cp->dmarx,
                            STM32_I2C_I2C3_IRQ_PRIORITY,
                            (stm32_dmaisr_t)i2c_lld_serve_rx_end_irq,
                            (void *)i2cp);
      chDbgAssert(!b, "uart_lld_start(), #3", "stream already allocated");
      b = dmaStreamAllocate(i2cp->dmatx,
                            STM32_I2C_I2C3_IRQ_PRIORITY,
                            (stm32_dmaisr_t)i2c_lld_serve_tx_end_irq,
                            (void *)i2cp);
      chDbgAssert(!b, "uart_lld_start(), #4", "stream already allocated");
      rccEnableI2C3(FALSE);
      nvicEnableVector(I2C3_EV_IRQn,
          CORTEX_PRIORITY_MASK(STM32_I2C_I2C3_IRQ_PRIORITY));
      nvicEnableVector(I2C3_ER_IRQn,
          CORTEX_PRIORITY_MASK(STM32_I2C_I2C3_IRQ_PRIORITY));

      i2cp->dmamode |= STM32_DMA_CR_CHSEL(I2C3_RX_DMA_CHANNEL) |
                            STM32_DMA_CR_PL(STM32_I2C_I2C3_DMA_PRIORITY);
    }
#endif /* STM32_I2C_USE_I2C2 */

  }
  i2cp->dmamode |= STM32_DMA_CR_PSIZE_BYTE |
                   STM32_DMA_CR_MSIZE_BYTE |
                   STM32_DMA_CR_MINC |
                   STM32_DMA_CR_TCIE;
  dmaStreamSetPeripheral(i2cp->dmarx, &i2cp->id_i2c->DR);
  dmaStreamSetPeripheral(i2cp->dmatx, &i2cp->id_i2c->DR);

  i2cp->id_i2c->CR1 = I2C_CR1_SWRST;        /* reset i2c peripheral */
  i2cp->id_i2c->CR1 = 0;
  i2c_lld_set_clock(i2cp);
  i2c_lld_set_opmode(i2cp);

  i2cp->id_i2c->CR1 |= 1;                   /* enable interface */
}


/**
 * @brief Reset interface via RCC.
 */
void i2c_lld_reset(I2CDriver *i2cp){
  chDbgCheck((i2cp->id_state == I2C_STOP)||(i2cp->id_state == I2C_READY),
             "i2c_lld_reset: invalid state");

  #if STM32_I2C_USE_I2C1
  if (&I2CD1 == i2cp)
    rccResetI2C1();
  #endif /* STM32_I2C_USE_I2C1 */

  #if STM32_I2C_USE_I2C2
  if (&I2CD2 == i2cp)
    rccResetI2C2();
  #endif /* STM32_I2C_USE_I2C2 */

  #if STM32_I2C_USE_I2C3
  if (&I2CD3 == i2cp)
      rccResetI2C3();
  #endif /* STM32_I2C_USE_I2C3 */
}


/**
 * @brief Receive data via the I2C bus as master.
 * @details Number of receiving bytes must be more than 1 because of stm32
 *          hardware restrictions.
 *
 * @param[in] i2cp        pointer to the @p I2CDriver object
 * @param[in] slave_addr  slave device address
 * @param[in] rxbuf       pointer to the receive buffer
 * @param[in] rxbytes     number of bytes to be received
 *
 * @return                The operation status.
 * @retval RDY_OK         if the function succeeded.
 * @retval RDY_RESET      if one or more I2C errors occurred, the errors can
 *                        be retrieved using @p i2cGetErrors().
 * @retval RDY_TIMEOUT    if a timeout occurred before operation end.
 */
msg_t i2c_lld_master_receive_timeout(I2CDriver *i2cp,
                                    uint8_t slave_addr,
                                    uint8_t *rxbuf,
                                    size_t rxbytes,
                                    systime_t timeout){

  msg_t rdymsg;

  chSysUnlock(); /* release lock from high level call */

  chDbgCheck((rxbytes > 1), "i2c_lld_master_receive");

  /* init driver fields */
  i2cp->slave_addr = (slave_addr << 1) | 0x01;    /* LSB = 1 -> receive */
  i2cp->rxbytes = rxbytes;
  i2cp->rxbuf = rxbuf;
  i2cp->errors = 0;

  /* TODO: DMA error handling */
  dmaStreamSetMemory0(i2cp->dmarx, rxbuf);
  dmaStreamSetTransactionSize(i2cp->dmarx, rxbytes);
  dmaStreamSetMode(i2cp->dmarx, ((i2cp->dmamode) | STM32_DMA_CR_DIR_P2M));

  i2c_lld_wait_bus_free(i2cp);

  /* wait stop bit from previous transaction*/
  while(i2cp->id_i2c->CR1 & I2C_CR1_STOP)
    ;

  i2cp->id_i2c->CR2 |= I2C_CR2_ITERREN | I2C_CR2_ITEVTEN;
  i2cp->id_i2c->CR1 |= I2C_CR1_START | I2C_CR1_ACK;

  i2c_lld_wait_s(i2cp, timeout, rdymsg);

  return rdymsg;
}


/**
 * @brief Transmits data via the I2C bus as master.
 *
 * @details Number of receiving bytes must be 0 or more than 1 because of stm32
 *          hardware restrictions.
 *
 * @param[in] i2cp        pointer to the @p I2CDriver object
 * @param[in] slave_addr  slave device address
 * @param[in] txbuf       pointer to the transmit buffer
 * @param[in] txbytes     number of bytes to be transmitted
 * @param[in] rxbuf       pointer to the receive buffer
 * @param[in] rxbytes     number of bytes to be received
 *
 * @return                The operation status.
 * @retval RDY_OK         if the function succeeded.
 * @retval RDY_RESET      if one or more I2C errors occurred, the errors can
 *                        be retrieved using @p i2cGetErrors().
 * @retval RDY_TIMEOUT    if a timeout occurred before operation end.
 */
msg_t i2c_lld_master_transmit_timeout(I2CDriver *i2cp, uint8_t slave_addr,
                                      const uint8_t *txbuf, size_t txbytes,
                                      uint8_t *rxbuf, size_t rxbytes,
                                      systime_t timeout){

  msg_t rdymsg;

  chSysUnlock(); /* release lock from high level call */

  chDbgCheck(((rxbytes == 0) || ((rxbytes > 1) && (rxbuf != NULL))),
      "i2cMasterTransmit");

  /* init driver fields */
  i2cp->slave_addr = (slave_addr << 1) & 0x00FE;         /* LSB = 0 -> write */
  i2cp->txbytes = txbytes;
  i2cp->rxbytes = rxbytes;
  i2cp->rxbuf = rxbuf;
  i2cp->errors = 0;

  /* TODO: DMA error handling */
  dmaStreamSetMemory0(i2cp->dmatx, txbuf);
  dmaStreamSetTransactionSize(i2cp->dmatx, txbytes);
  dmaStreamSetMode(i2cp->dmatx, ((i2cp->dmamode) | STM32_DMA_CR_DIR_M2P));

  i2c_lld_wait_bus_free(i2cp);

  /* wait stop bit from previous transaction*/
  while(i2cp->id_i2c->CR1 & I2C_CR1_STOP)
    ;

  i2cp->id_i2c->CR2 |= I2C_CR2_ITERREN | I2C_CR2_ITEVTEN;
  i2cp->id_i2c->CR1 |= I2C_CR1_START;

  i2c_lld_wait_s(i2cp, timeout, rdymsg);

  return rdymsg;
}


/**
 * @brief   Receive data via the I2C bus after writing.
 *
 * @param[in] i2cp        pointer to the @p I2CDriver object
 *
 * @notapi
 */
inline void i2c_lld_master_transceive(I2CDriver *i2cp){
  /* There are no checks in this function because:
     - all values checked earlier
     - this function calls from ISR */

  /* init driver fields */
  i2cp->slave_addr |= 0x01;    /* LSB = 1 -> receive */

  /* TODO: DMA error handling */
  dmaStreamSetMemory0(i2cp->dmarx, i2cp->rxbuf);
  dmaStreamSetTransactionSize(i2cp->dmarx, i2cp->rxbytes);
  dmaStreamSetMode(i2cp->dmarx, ((i2cp->dmamode) | STM32_DMA_CR_DIR_P2M));

